sampleresults/laptop-nvme-btrfs/write-test.txt
rand-write-bs1m: (g=0): rw=randwrite, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=1
rand-write-bs4k: (g=1): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=1
fio-3.30
Starting 2 processes
Jobs: 1 (f=1): [_(1),F(1)][100.0%][w=162MiB/s][w=41.6k IOPS][eta 00m:00s]
rand-write-bs1m: (groupid=0, jobs=1): err= 0: pid=12455: Sat Feb 25 14:16:58 2023
  write: IOPS=1033, BW=1034MiB/s (1084MB/s)(61.0GiB/60426msec); 0 zone resets
    slat (usec): min=115, max=697003, avg=704.53, stdev=13120.34
    clat (nsec): min=280, max=31507, avg=478.12, stdev=509.27
     lat (usec): min=115, max=697014, avg=697.82, stdev=12991.37
    clat percentiles (nsec):
     |  1.00th=[  298],  5.00th=[  306], 10.00th=[  314], 20.00th=[  322],
     | 30.00th=[  330], 40.00th=[  342], 50.00th=[  350], 60.00th=[  366],
     | 70.00th=[  390], 80.00th=[  450], 90.00th=[  676], 95.00th=[ 1160],
     | 99.00th=[ 2288], 99.50th=[ 2928], 99.90th=[ 7136], 99.95th=[ 7776],
     | 99.99th=[14272]
   bw (  MiB/s): min=    2, max= 2056, per=100.00%, avg=1134.23, stdev=844.83, samples=110
   iops        : min=    2, max= 2056, avg=1134.14, stdev=844.79, samples=110
  lat (nsec)   : 500=83.68%, 750=7.72%, 1000=2.53%
  lat (usec)   : 2=4.55%, 4=1.23%, 10=0.28%, 20=0.01%, 50=0.01%
  cpu          : usr=1.38%, sys=42.94%, ctx=25633, majf=0, minf=37
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,62464,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
rand-write-bs4k: (groupid=1, jobs=1): err= 0: pid=12500: Sat Feb 25 14:16:58 2023
  write: IOPS=141k, BW=550MiB/s (576MB/s)(32.9GiB/61367msec); 0 zone resets
    slat (nsec): min=1845, max=369512k, avg=4173.57, stdev=301083.86
    clat (nsec): min=181, max=94404, avg=278.06, stdev=168.74
     lat (usec): min=2, max=369520, avg= 4.52, stdev=301.10
    clat percentiles (nsec):
     |  1.00th=[  207],  5.00th=[  219], 10.00th=[  227], 20.00th=[  237],
     | 30.00th=[  243], 40.00th=[  251], 50.00th=[  258], 60.00th=[  266],
     | 70.00th=[  278], 80.00th=[  298], 90.00th=[  326], 95.00th=[  382],
     | 99.00th=[  660], 99.50th=[  708], 99.90th=[  868], 99.95th=[ 1080],
     | 99.99th=[ 4048]
   bw (  KiB/s): min=    8, max=1037440, per=100.00%, avg=609851.21, stdev=330734.19, samples=112
   iops        : min=    2, max=259360, avg=152462.79, stdev=82683.52, samples=112
  lat (nsec)   : 250=39.09%, 500=57.98%, 750=2.64%, 1000=0.22%
  lat (usec)   : 2=0.03%, 4=0.02%, 10=0.01%, 20=0.01%, 50=0.01%
  lat (usec)   : 100=0.01%
  cpu          : usr=9.44%, sys=81.04%, ctx=54740, majf=0, minf=36
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,8633767,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=1034MiB/s (1084MB/s), 1034MiB/s-1034MiB/s (1084MB/s-1084MB/s), io=61.0GiB (65.5GB), run=60426-60426msec

Run status group 1 (all jobs):
  WRITE: bw=550MiB/s (576MB/s), 550MiB/s-550MiB/s (576MB/s-576MB/s), io=32.9GiB (35.4GB), run=61367-61367msec